Repository: nysenate/NYSenate.gov-Website-2009
Catalog: drupal/sites/all/modules/contrib/conditional_fields/translations/*.po
Languages: sv

source: These settings only apply to the conditional fields of this content type.
sv: Dessa inställningar gäller enbart för villkorliga fält till denna innehållstyp.

source: The Conditional Fields module allows to set fields with allowed values as "controlling fields" for other fields and groups. When a field or group is "controlled", it will only be available for editing and displayed if the selected values of the controlling field match the "trigger values" assigned to it. You can, for example, make a custom "article teaser" field that is shown only if a "Has teaser" checkbox is checked.
sv: Modulen villkorliga fält (Conditional Fields) låter dig ange fält med tillåtna värden som "styrda fält" för andra fält och grupper. När ett fält eller grupp är "styrt" så kommer det enbart vara tillgängligt för redigering och visas om det valda värdet för det styrda fältet överensstämmer med det "utlösta värdet" som tillhör det. Du kan till exempel göra ett anpassat fält "förhandsgranska artikel" som enbart visas om en kryssruta "Har förhandstitt" är markerad.

source: When editing a node, the controlled fields are dynamically shown and hidden with javascript.
sv: Vid redigering av en nod så kommer de styrda fälten visas och gömmas dynamiskt med JavaScript.

source: On node view, the controlled fields which were left untriggered are hidden.
sv: Vid nodvisning så kommer styrda fält gömmas som lämnades att inte lösas ut.

source: Once the module is activated, a new set of options will appear in the editing form of cck fields, from where you can select which of the allowed values available of candidate "controlling" fields will make the field "controlled". If <em>- Not controlling -</em> or no value is selected, the field will be shown as usual.
sv: När modulen är aktiverad så kommer ett ny omgång av alternativ att visas i formuläret för redigering av CCK-fält där du kan välja vilka av de tillåtna värden tillgängliga för kandiderade "styrda" fält som kommer göra fältet "styrt". Om <em>- Styr ej -</em> eller inget värde är valt så kommer fältet att visas som vanligt.

source: These are the requisites to make a field controllable:
sv: Detta är kraven för att göra ett fält styrbart:

source: The controlling field widget must be single or multiple select list, radio buttons or checkboxes.
sv: Gränssnittskomponenten för styrande av fält måste antingen vara en enstaka eller flervalslista, radioknappar eller kryssrutor.

source: The controlling field must have allowed values.
sv: Det styrande fältet måste ha tillåtna värden.

source: If the controlled field is in a group, the controlling field must be in the same group.
sv: Om det styrda fältet är i en grupp så måste det styrande fältet vara inom samma grupp.

source: If you want to make a group controllable, the controlling field should not be inside a group.
sv: Om du vill göra en grupp styrbar så får inte det styrande fältet vara inuti en grupp.

source: There is also a "Conditional fields" settings tab in every content type admin page.
sv: Det finns också en flik "Villkorliga fält" under varje sida för adminstrering av innehållstyp.

source: The <a href="@handbook">Conditional Fields Handbook</a> contains further explanations and examples.
sv: <a href="@handbook">Conditional Fields Handbook</a> innehåller fler förklaringar och exempel.

source: User Interface options
sv: Alternativ för användargränssnitt

source: Don't use javascript. Fields are only hidden on node view.
sv: Använd inte JavaScript. Fält göms enbart vid nodvisning.

source: Hide untriggered fields
sv: Göm ej utlösta fält

source: Disable untriggered fields
sv: Inaktivera ej utlösta fält

source: Choose the desired javascript behaviour in node editing forms.
sv: Välj önskat uppförande på JavaScript i formulär för redigering av noder.

source: These settings have effect only if you select the 'Hide untriggered fields' option above.
sv: Dessa inställningar påverkas enbart om du valt alternativet "Göm ej utlösta fält" ovan.

source: Type
sv: Typ

source: No animation
sv: Ingen animation

source: Slide down
sv: Glid ned

source: Fade
sv: Tona

source: Speed
sv: Hastighet

source: The speed at which the animation is performed. Slow = 600ms; Normal = 400ms; Fast = 200ms.
sv: Hastigheten som animationen genomförs i. Långsam = 600 ms, normal = 400 ms, snabb = 200 ms.

source: Slow
sv: Långsam

source: Fast
sv: Snabb

source: Orphaned controlled fields settings
sv: Inställningar för oanvända styrda fält

source: Configure the visibility/editability of controlled fields whose controlling fields are not visible/editable.
sv: Konfigurera synligheten/redigeringsmöjligheten av styrda fält vars styrda fält inte är synliga/redigerbara.

source: Hide
sv: Göm

source: Show only if triggered
sv: Visa enbart om utlöst

source: Show
sv: Visa

source: On node view
sv: Vid visning av nod

source: On node edit
sv: Vid redigering av nod

source: Reset untriggered fields to default values
sv: Återställ ej utlösta fält till dess förvalda värden

source: Select this box to reset untriggered controlled fields to their default values when saving a node.
sv: Markera denna ruta för att återställa ej utlösta styrda fält till ders förvalda värden när en nod sparas.

source: Administrators see all fields
sv: Administratörer ser alla fält

source: Select this box to let users with the <a href="@access-control-page">administer conditional fields</a> permission to view all controlled fields of a node.
sv: Markera denna ruta för att låta användare med rättigheten <a href="@access-control-page">administrera villkorliga fält</a> att visa alla styrda fält för en nod.

source: Delete
sv: Ta bort

source: Delete all conditional fields configured for this content type. This will delete the conditional fields settings, not the fields themselves.
sv: Radera alla villkorliga fält konfigurerade för denna innehållstyp. Detta kommer att radera inställningarna för villkorliga fält, inte fälten i sig.

source: Save
sv: Spara

source: Conditional fields options for this content type saved.
sv: Alternativ för villkorliga fält för denna innehållstyp har sparats.

source: All configured conditional fields for this content type have been deleted.
sv: Alla konfigurerade villkorliga fält för denna innehållstyp har tagits bort.

source: Change basic information
sv: Ändra grundläggande information

source: Below is a list of all fields and groups controlled by this field. If you want to make this field controllable, you have to clear the settings for each controlled field.
sv: Nedan är en lista för alla fält och grupper som är styrda av detta fält. Om du vill göra detta fält styrbart så måste dy rensa inställningarna för varje styrt fält.

source: group
sv: grupp

source: <a href="@edit-group">edit</a>
sv: <a href="@edit-group">redigera</a>

source: field
sv: fält

source: <a href="@edit-field">edit</a>
sv: <a href="@edit-field">redigera</a>

source: Name
sv: Namn

source: Trigger values
sv: Utlösande värden

source: Options
sv: Alternativ

source: Choose which allowed values of available controlling fields will trigger this @context, making it visible both in node editing and view. If no value is set, the @context will be always visible. Only fields and groups within the same group as this one, and with <em>Allowed values</em> set, are available for control.
sv: Välj vilka tillåtna värden av de tillgängliga styrda fälten som kommer att lösa ut detta @context vilket gör det synligt både i redigering och visning. Om inget värde är angivet så kommer @context alltid att synas. Enbart fält och grupper inom samma grupp som denna och med <em>Tillåtna värden</em> angivet är tillgängligt för styrning.

source: - Not controlling -
sv: - Styr ej -

source: <a href="@edit-field">Edit the allowed values</a> of %field-name.
sv: <a href="@edit-field">Redigera de tillåtna värdena</a> för %field-name.

source: Conditional fields settings
sv: Inställningar för villkorliga fält

source: You cannot select more than one controlling field.
sv: Du kan inte välja mer än ett styrande fält.

source: You cannot select 'Not controlling' and other values at the same time.
sv: Du kan inte välja "Styr ej" och andra värden på samma gång.

source: If you changed or removed any allowed value from the field, you might have to review its controlled fields and fieldgroups settings.
sv: Om du ändrar eller tar bort ett värde från ett fält så måste du kanske granska inställningarna för dess styrda fält och fältgrupper.

source: !name field is required.
sv: Fältet !name är obligatoriskt.

source: You can't change the parent group of a conditional field.
sv: Du kan inte ändra överliggande grupp för ett villkorligt fält.

source: <div class="description">Controlled by <em>@controlling</em></div>
sv: <div class="description">Styrt av <em>@controlling</em></div>

source: <div class="description">Controlling <em>@controlled</em></div>
sv: <div class="description">Styr <em>@controlled</em></div>

source: administer conditional fields
sv: administrera villkorliga fält

source: Conditional fields
sv: Villkorliga fält

source: Conditional Fields
sv: Villkorliga fält

source: Content fields and groups visibility based on the values of user defined 'trigger' fields.
sv: Synlighet för innehållsfält och grupper baserat på värdet för utlösande användardefinierade fält.
